In [1]:
from sqlalchemy import create_engine
import pandas as pd
from snowflake.sqlalchemy import URL

engine = create_engine(
    'snowflake://{user}:{password}@{account}/d'.format(
        user='ESTPEGION',
        password='SnowFlake1234!',
        account='mg61873.ca-central-1.aws',
        database = 'KPMG',
        schema = 'public',
        warehouse = 'COMPUTE_WH',
        role='accountadmin',
        numpy = True
    )
)

connection = engine.connect()
results = connection.execute('select current_version()').fetchone()
print(results[0])

import pandas as pd
pd.read_sql_query('''USE SCHEMA SNOWFLAKE_SAMPLE_DATA.TPCDS_SF10TCL;''',engine)
# finally:
#     connection.close()
#     engine.dispose()

C:\Users\zwdua\AppData\Local\Temp\ipykernel_22416\2807436146.py:19: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  results = connection.execute('select current_version()').fetchone()

7.7.4

                             status
0  Statement executed successfully.

NameError: name 'engine' is not defined

In [9]:
# url = f'snowflake://ESTPEGION:SnowFlake1234!@mg61873.ca-central-1.aws/KPMG/public?warehouse=testwh&role=myrole'

In [2]:
connection.execute(
    'USE DATABASE SNOWFLAKE_SAMPLE_DATA')

connection.execute(
    "USE SCHEMA TPCDS_SF10TCL")

In [4]:
import pandas as pd
pd.read_sql_query('''USE SCHEMA SNOWFLAKE_SAMPLE_DATA.TPCDS_SF10TCL;''',engine)

                             status
0  Statement executed successfully.

In [7]:
pd.read_sql_query('select * from WEB_SALES limit 100',engine)

,ws_sold_date_sk,ws_sold_time_sk,ws_ship_date_sk,ws_item_sk,ws_bill_customer_sk,ws_bill_cdemo_sk,ws_bill_hdemo_sk,ws_bill_addr_sk,ws_ship_customer_sk,ws_ship_cdemo_sk,...,ws_ext_wholesale_cost,ws_ext_list_price,ws_ext_tax,ws_coupon_amt,ws_ext_ship_cost,ws_net_paid,ws_net_paid_inc_tax,ws_net_paid_inc_ship,ws_net_paid_inc_ship_tax,ws_net_profit
0,2452116,43236,2452204,232791,11287283,114933,1336,29675386,52758573,698150,...,106.50,255.60,4.33,0.00,30.53,86.62,90.95,117.15,121.48,-19.88
1,2452116,24934,2452199,232791,48721425,1157371,4517,28879663,16606142,810611,...,3606.65,9593.53,0.00,0.00,4796.50,3933.13,3933.13,8729.63,8729.63,326.48
2,2452116,60006,2452222,232791,36750319,560011,1703,22728548,63400923,374316,...,943.16,2593.50,79.87,0.00,752.02,1141.14,1221.01,1893.16,1973.03,197.98
3,2452116,34600,2452161,232791,34225914,280589,4417,16563892,62593532,1189367,...,1833.93,2622.03,3.10,0.00,943.59,51.83,54.93,995.42,998.52,-1782.10
4,2452116,67565,2452189,232791,1342954,201232,4310,8053788,48514788,1903555,...,1902.80,4623.60,88.76,0.00,230.80,4438.40,4527.16,4669.20,4757.96,2535.60
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2452116,26410,2452186,232807,37508979,1070111,4490,7889622,42148163,1737754,...,2956.59,6829.20,143.41,0.00,341.46,2390.22,2533.63,2731.68,2875.09,-566.37
96,2452116,40417,2452133,232807,51125752,1600909,4066,18480023,21778473,615605,...,1094.78,3032.40,104.61,0.00,151.62,2092.28,2196.89,2243.90,2348.51,997.50
97,2452116,43996,2452159,232807,41921563,147776,5189,21704202,13094525,885750,...,3448.98,9105.21,268.03,291.34,1091.88,3350.42,3618.45,4442.30,4710.33,-98.56
98,2452116,28285,2452226,232809,19346219,1356340,5661,22072582,34601120,1565835,...,4749.36,6458.76,49.68,0.00,193.20,709.80,759.48,903.00,952.68,-4039.56
99,2452116,44762,2452167,232809,59721632,1010965,2698,28563231,4318645,1279170,...,3100.50,3689.50,33.16,0.00,36.50,368.50,401.66,405.00,438.16,-2732.00

In [4]:
# question 2
pd.read_sql_query('''
WITH wscs AS
  (SELECT sold_date_sk,
          sales_price
   FROM
     (SELECT ws_sold_date_sk sold_date_sk,
             ws_ext_sales_price sales_price
      FROM web_sales
      UNION ALL SELECT cs_sold_date_sk sold_date_sk,
                       cs_ext_sales_price sales_price
      FROM catalog_sales) sq1
      ),
     wswscs AS
  (SELECT d_week_seq,
          sum(CASE
                  WHEN (d_day_name='Sunday') THEN sales_price
                  ELSE NULL
              END) sun_sales,
          sum(CASE
                  WHEN (d_day_name='Monday') THEN sales_price
                  ELSE NULL
              END) mon_sales,
          sum(CASE
                  WHEN (d_day_name='Tuesday') THEN sales_price
                  ELSE NULL
              END) tue_sales,
          sum(CASE
                  WHEN (d_day_name='Wednesday') THEN sales_price
                  ELSE NULL
              END) wed_sales,
          sum(CASE
                  WHEN (d_day_name='Thursday') THEN sales_price
                  ELSE NULL
              END) thu_sales,
          sum(CASE
                  WHEN (d_day_name='Friday') THEN sales_price
                  ELSE NULL
              END) fri_sales,
          sum(CASE
                  WHEN (d_day_name='Saturday') THEN sales_price
                  ELSE NULL
              END) sat_sales
   FROM wscs,
        date_dim
   WHERE d_date_sk = sold_date_sk
   GROUP BY d_week_seq
   limit 10000)
SELECT d_week_seq1,
       round(sun_sales1/sun_sales2, 2),
       round(mon_sales1/mon_sales2, 2),
       round(tue_sales1/tue_sales2, 2),
       round(wed_sales1/wed_sales2, 2),
       round(thu_sales1/thu_sales2, 2),
       round(fri_sales1/fri_sales2, 2),
       round(sat_sales1/sat_sales2, 2)
FROM
  (SELECT wswscs.d_week_seq d_week_seq1,
          sun_sales sun_sales1,
          mon_sales mon_sales1,
          tue_sales tue_sales1,
          wed_sales wed_sales1,
          thu_sales thu_sales1,
          fri_sales fri_sales1,
          sat_sales sat_sales1
   FROM wswscs,
        date_dim
   WHERE date_dim.d_week_seq = wswscs.d_week_seq
     AND d_year = 2001) y,
  (SELECT wswscs.d_week_seq d_week_seq2,
          sun_sales sun_sales2,
          mon_sales mon_sales2,
          tue_sales tue_sales2,
          wed_sales wed_sales2,
          thu_sales thu_sales2,
          fri_sales fri_sales2,
          sat_sales sat_sales2
   FROM wswscs,
        date_dim
   WHERE date_dim.d_week_seq = wswscs.d_week_seq
     AND d_year = 2001+1) z
WHERE d_week_seq1 = d_week_seq2-53
ORDER BY d_week_seq1
limit 1000;
''',engine)

,d_week_seq1,"ROUND(SUN_SALES1/SUN_SALES2, 2)","ROUND(MON_SALES1/MON_SALES2, 2)","ROUND(TUE_SALES1/TUE_SALES2, 2)","ROUND(WED_SALES1/WED_SALES2, 2)","ROUND(THU_SALES1/THU_SALES2, 2)","ROUND(FRI_SALES1/FRI_SALES2, 2)","ROUND(SAT_SALES1/SAT_SALES2, 2)"
0,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
1,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
2,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
3,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
4,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
...,...,...,...,...,...,...,...,...
995,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
996,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
997,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
998,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
999,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00

In [23]:
pd.read_sql_query('''with customer_total_return as
(select sr_customer_sk as ctr_customer_sk
,sr_store_sk as ctr_store_sk
,sum(SR_RETURN_QUANTITY) as ctr_total_return
from store_returns
,date_dim
where sr_returned_date_sk = d_date_sk
and d_year = 2000
group by sr_customer_sk
,sr_store_sk
limit 500)
 select  c_customer_id
from customer_total_return ctr1
,store
,customer
where ctr1.ctr_total_return > (select avg(ctr_total_return)*1.2
from customer_total_return ctr2
where ctr1.ctr_store_sk = ctr2.ctr_store_sk)
and s_store_sk = ctr1.ctr_store_sk
and s_state = 'TN'
and ctr1.ctr_customer_sk = c_customer_sk
order by c_customer_id
 limit 5;''',engine)

      c_customer_id
0  AAAAAAAAEJFAMLCA
1  AAAAAAAAFKEFFFBA
2  AAAAAAAALPPAPDBA
3  AAAAAAAAPPFJJPBA

In [20]:
#YEAR.01 corresponding to d_year of date_dim

pd.read_sql_query('''SELECT DISTINCT d_year FROM date_dim;''', engine)

     d_year
0      1900
1      1901
2      1902
3      1903
4      1904
..      ...
196    2057
197    2064
198    2071
199    2082
200    2049

[201 rows x 1 columns]

In [7]:
#STATE.01 corresponding to s_state in store

q1_state = pd.read_sql_query('''SELECT DISTINCT s_state FROM store;''', engine)

In [15]:
list(q1_state.values.T[0]).

['TN',
 'NM',
 'KY',
 'IA',
 'NC',
 'OH',
 'GA',
 'IN',
 'AL',
 'SC',
 'MD',
 'LA',
 'SD',
 'MI',
 'FL',
 'WV',
 'VT',
 'TX',
 'MT',
 'CA',
 'NJ',
 'CO',
 'OK',
 'IL',
 None,
 'NE',
 'OR',
 'NY',
 'MO',
 'WI',
 'VA',
 'PA',
 'WA',
 'KS',
 'MN']

In [24]:
#Add variable in json here!

import json
var_store = {}
var_store['q1_state'] = ['TN',
 'NM',
 'KY',
 'IA',
 'NC',
 'OH',
 'GA',
 'IN',
 'AL',
 'SC',
 'MD',
 'LA',
 'SD',
 'MI',
 'FL',
 'WV',
 'VT',
 'TX',
 'MT',
 'CA',
 'NJ',
 'CO',
 'OK',
 'IL',
 'None',
 'NE',
 'OR',
 'NY',
 'MO',
 'WI',
 'VA',
 'PA',
 'WA',
 'KS',
 'MN']

var_store['q1_agg'] = ['SR_RETURN_AMT','SR_RETURN_AMT_INC_TAX','SR_RETURN_QUANTITY','SR_RETURN_TAX','SR_RETURN_SHIP_COST']

var_store

var_store_json = json.dumps(var_store,sort_keys=False,separators=(',', ': '))
# Writing to var_store.json
with open("var_store.json", "w") as outfile:
    outfile.write(var_store_json)

In [20]:
type(json.load(open('var_store.json'))['q1_state'])

list